/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Rozšírenie Telesec";
"06 06 02 82 06 01 0A 01"		= "Mechanizmus Telesec";

"06 07 02 82 06 01 0A 01 00"	= "Autentifikácia Telesec";
"06 08 02 82 06 01 0A 01 00 01"	= "Autentifikácia hesla";
"06 08 02 82 06 01 0A 01 00 02" = "Autentifikácia chráneného hesla";
"06 08 02 82 06 01 0A 01 00 03" = "Jednosmerná X.509 autentifikácia";
"06 08 02 82 06 01 0A 01 00 04" = "Obojsmerná X.509 autentifikácia";
"06 08 02 82 06 01 0A 01 00 05" = "Troj-smerová X.509 autentifikácia";
"06 08 02 82 06 01 0A 01 00 06" = "Jednosmerná ISO9798 autentifikácia";
"06 08 02 82 06 01 0A 01 00 07" = "Obojsmerná ISO9798 autentifikácia";
"06 08 02 82 06 01 0A 01 00 08" = "Autentifikácia Telekom";

"06 07 02 82 06 01 0A 01 01"	= "Telesec podpis";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 s RSA a ISO9697";
"06 08 02 82 06 01 0A 01 01 02"	= "MD4 s podpisovými štandardmi RSA a Telesec";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 s RSA a ISO9697";
"06 08 02 82 06 01 0A 01 01 04"	= "MD5 s podpisovými štandardmi RSA a Telesec";
"06 08 02 82 06 01 0A 01 01 05"	= "RIPEMD-160 s podpisovými štandardmi RSA a Telekom ";
"06 08 02 82 06 01 0A 01 01 09"	= "HBCI RSA podpis";

"06 07 02 82 06 01 0A 01 02"	= "Šifrovanie Telesec";
"06 08 02 82 06 01 0A 01 02 00"	= "žiadny";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Purpurová";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "Jednosmerná funkcia";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "Hašovať použitím blokového kódovania";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "Funkcia FEC";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Modul Telesec";
"06 07 02 82 06 01 0A 02 00"	= "Algoritmy";
"06 07 02 82 06 01 0A 02 01"	= "Typy atribútu";
"06 07 02 82 06 01 0A 02 02"	= "Typy certifikátov";
"06 07 02 82 06 01 0A 02 03"	= "Typy správ";
"06 07 02 82 06 01 0A 02 04"	= "PL protokol";
"06 07 02 82 06 01 0A 02 05"	= "SME a komponenty SME";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "Užitočné definície";
"06 07 02 82 06 01 0A 02 08"	= "Súbory STE";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "Elektronická objednávka";
"06 07 02 82 06 01 0A 02 0B"	= "Asymetrická aplikácia Telesec TTP";
"06 07 02 82 06 01 0A 02 0C"	= "Základná aplikácia Telesec TTP";
"06 07 02 82 06 01 0A 02 0D"	= "Telesec TTP správy";
"06 07 02 82 06 01 0A 02 0E"	= "Aplikácia časovej pečiatky Telesec TTP";

"06 06 02 82 06 01 0A 03"		= "Trieda objektu";
"06 07 02 82 06 01 0A 03 00"	= "Iný názov Telesec";
"06 07 02 82 06 01 0A 03 01"	= "Adresár";
"06 07 02 82 06 01 0A 03 02"	= "Typ adresára";
"06 07 02 82 06 01 0A 03 03"	= "Skupina adresárov";
"06 07 02 82 06 01 0A 03 04"	= "Užívateľ adresára";
"06 07 02 82 06 01 0A 03 05"	= "Záznam symetrického kľúča";

"06 06 02 82 06 01 0A 04"		= "Balík";
"06 06 02 82 06 01 0A 05"		= "Parameter";
"06 06 02 82 06 01 0A 06"		= "Väzba názvu";
"06 06 02 82 06 01 0A 07"		= "Atribút";
"06 07 02 82 06 01 0A 07 00"	= "Identifikátor skupiny aplikácií";
"06 07 02 82 06 01 0A 07 01"	= "Typ certifikátu";
"06 07 02 82 06 01 0A 07 02"	= "Certifikát Telesec";
"06 07 02 82 06 01 0A 07 03"	= "Číslo certifikátu";
"06 07 02 82 06 01 0A 07 04"	= "Zoznam revokovaných certifikátov";
"06 07 02 82 06 01 0A 07 05"	= "Dátum vytvorenia";
"06 07 02 82 06 01 0A 07 06"	= "Vydavateľ";
"06 07 02 82 06 01 0A 07 07"	= "Menovacia autorita";
"06 07 02 82 06 01 0A 07 08"	= "Adresár verejného kľúča";
"06 07 02 82 06 01 0A 07 09"	= "Bezpečnostná doména";
"06 07 02 82 06 01 0A 07 0A"	= "Subjekt";
"06 07 02 82 06 01 0A 07 0B"	= "Čas revokácie";
"06 07 02 82 06 01 0A 07 0C"	= "Referencia skupiny užívateľov";
"06 07 02 82 06 01 0A 07 0D"	= "Platnosť";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "Prostredie bezpečnostnej správy";
"06 07 02 82 06 01 0A 07 10"	= "Adresár anonymného verejného kľúča";
"06 07 02 82 06 01 0A 07 11"	= "Stanovený názov Telesec";
"06 07 02 82 06 01 0A 07 12"	= "Prílohy mena";
"06 07 02 82 06 01 0A 07 13"	= "Telesec PSČ";
"06 07 02 82 06 01 0A 07 14"	= "Oddeľovač názvu";
"06 07 02 82 06 01 0A 07 15"	= "Zoznam Telesec certifikátov";
"06 07 02 82 06 01 0A 07 16"	= "Zoznam Teletrust certifikátov";
"06 07 02 82 06 01 0A 07 17"	= "Zoznam certifikátov X.509";
"06 07 02 82 06 01 0A 07 18"	= "Čas vydania";
"06 07 02 82 06 01 0A 07 19"	= "Číslo skutočnej karty";
"06 07 02 82 06 01 0A 07 1A"	= "Typ súboru";
"06 07 02 82 06 01 0A 07 1B"	= "Ctl súbor je archív";
"06 07 02 82 06 01 0A 07 1C"	= "Emailová adresa";
"06 07 02 82 06 01 0A 07 1D"	= "Zoznam šablón certifikátov";
"06 07 02 82 06 01 0A 07 1E"	= "Názov adresára";
"06 07 02 82 06 01 0A 07 1F"	= "Názov typu adresára";
"06 07 02 82 06 01 0A 07 20"	= "Názov skupiny adresárov";
"06 07 02 82 06 01 0A 07 21"	= "Názov užívateľa adresára";
"06 07 02 82 06 01 0A 07 22"	= "Revokačná značka";
"06 07 02 82 06 01 0A 07 23"	= "Názov záznamu symetrického kľúča";
"06 07 02 82 06 01 0A 07 24"	= "Číslo GL";
"06 07 02 82 06 01 0A 07 25"	= "Číslo GO";
"06 07 02 82 06 01 0A 07 26"	= "Dáta G kľúča";
"06 07 02 82 06 01 0A 07 27"	= "Dáta Z kľúča";
"06 07 02 82 06 01 0A 07 28"	= "Dáta KT kľúča";
"06 07 02 82 06 01 0A 07 2A"	= "Číslo KT kľúča";
"06 07 02 82 06 01 0A 07 33"	= "Čas vytvorenia revokácie";
"06 07 02 82 06 01 0A 07 34"	= "Zodpovednosť";

"06 06 02 82 06 01 0A 08"		= "Skupina atribútov";
"06 06 02 82 06 01 0A 09"		= "Akcia";
"06 06 02 82 06 01 0A 0A"		= "Oznámenie";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "Bezpečnostná aplikácia";

"06 06 02 82 06 01 0A 0C"		= "Definície certifikátu a rozšírenia CRL";

"06 07 02 82 06 01 0A 0C 00"	= "Rozšírenie obmedzení zodpovednosti rozšírenia certifikátu";
"06 07 02 82 06 01 0A 0C 01"	= "ID rozšírenia Telesec certifikátu";
"06 07 02 82 06 01 0A 0C 02"	= "Identifikátor pravidiel Telesec";
"06 07 02 82 06 01 0A 0C 03"	= "ID kvalifikátora pravidiel Telesec";
"06 07 02 82 06 01 0A 0C 04"	= "Filtrované rozšírenie Telesec CRL";
"06 07 02 82 06 01 0A 0C 05"	= "Rozšírenie Telesec CRL filtra";
"06 07 02 82 06 01 0A 0C 06"	= "Rozšírenie menovacej autority Telesec";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "ID užívateľa";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "Emailová schránka RFC822";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "Komponent domény";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "Australian Business Number";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "Identifikátor pravidiel Certificates Australia";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Signet osobné";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Signet obchodný";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Signet právny";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Signet Pilot";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Signet IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Identifikátor pravidiel Signet";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "Symetrický šifrovací algoritmus";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "Identifikátor vysoko bezpečných pravidiel SEIS";
"06 06 2A 85 70 22 01 02"	= "Identifikátor pravidiel SEIS GAK";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "Osobný identifikátor SEIS AT";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "Modul ANSI X9.57";
"06 07 2A 86 48 CE 38 01 01"	= "Správa certifikátu X9F1";
"06 06 2A 86 48 CE 38 02"		= "Inštrukcia udržovania";
"06 07 2A 86 48 CE 38 02 01"	= "Inštrukcia udržovania-Žiadna";
"06 07 2A 86 48 CE 38 02 02"	= "Vydavateľ Call";
"06 07 2A 86 48 CE 38 02 03"	= "Odmietnuť";
"06 07 2A 86 48 CE 38 02 04"	= "Pickup token";
"06 06 2A 86 48 CE 38 03"		= "Atribút";
"06 06 2A 86 48 CE 38 03 01"	= "Protipodpis";
"06 06 2A 86 48 CE 38 03 02"	= "Atribútový certifikát";
"06 06 2A 86 48 CE 38 04"		= "Algoritmus";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "DSA zhoda";
"06 07 2A 86 48 CE 38 04 03"	= "DSA s SHA-1";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "Typ ANSI X9.62 poľa";
"06 07 2A 86 48 CE 3D 01 01"	= "Základné pole";
"06 07 2A 86 48 CE 3D 01 02"	= "Vlastnosť-Dve polia";
"06 09 2A 86 48 CE 3D 01 02 03"	= "Vlastnosť-Dva základy";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Nulový základ";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "Trojčlenný základ";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "Pentanomiálny základ";
"06 06 2A 86 48 CE 3D 02"		= "Typ verejného kľúča";
"06 07 2A 86 48 CE 3D 02 01"	= "Verejný kľúč Elliptic Curve";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "Typ ANSI X9.42 poľa";
"06 07 2A 86 48 CE 3E 01 01"	= "Galois Field Prime";
"06 06 2A 86 48 CE 3E 02"		= "Typ čísla";
"06 07 2A 86 48 CE 3E 02 01"	= "Diffie-Hellman verejný kľúč";
"06 06 2A 86 48 CE 3E 03"		= "Osnova";
"06 07 2A 86 48 CE 3E 03 01"	= "Statický Diffie-Hellman";
"06 07 2A 86 48 CE 3E 03 02"	= "Jednodenný Diffie-Hellman";
"06 07 2A 86 48 CE 3E 03 03"	= "Diffie-Hellman Hybrid 1";
"06 07 2A 86 48 CE 3E 03 04"	= "Diffie-Hellman Hybrid 2";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Informácie o verzii Entrust";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PKCS-12 PBE s MD5 a CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "MAC založená na hesle";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Užívateľ Entrust";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "CA Entrust informácie";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "Atribútový certifikát";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "RSA šifrovanie";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "MD2 s RSA šifrovaním";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "MD4 s RSA šifrovaním";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "MD5 s RSA šifrovaním";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "SHA-1 s RSA šifrovaním";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "RSA-OAEP šifrovanie (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "RSA-OAEP šifrovanie";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "Špacifikovaná známka RSA-OAEP";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "Osnova RSA-PSS podpisu";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "SHA-256 s RSA šifrovaním";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "SHA-384 s RSA šifrovaním";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "SHA-512 s RSA šifrovaním";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "SHA-224 s RSA šifrovaním";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "BSAFE šifrovanie";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Dohoda Diffie-Hellman kľúčov";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PKCS-12 PBE s MD2 a DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PKCS-12 PBE s MD5 a DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PKCS-12 PBE s MD2 a RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PKCS-12 PBE s MD5 a RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE s MD5 a XOR";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PKCS-12 PBE s SHA a DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "Dáta";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "Podpísané dáta";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "Šifrované dáta";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "Podpísané a šifrované dáta";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "Prehľad dát";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "Šifrované dáta";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "Dáta z atribútmy";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "Informácie o zašifrovanom privátnom kľúči";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "Emailová adresa";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "Neštandardizované meno";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "Typ obsahu";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "Prehľad správy";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "Čas podpisovania";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Protipodpis";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "Vyzvať na zadanie hesla";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "Neštandardizovaná adresa";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "Atribúty rozšíreného certifikátu";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "Vydavateľ a sériové číslo";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "Kontrola hesla";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "Verejný kľúč";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "Popis podpisovania";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "Požiadavka o rozšírenie";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "Možnosti S/MIME";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "Preferovať podpísané dáta";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "Nie je možné dešifrovať žiadne";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "Potvrdenie prijatia požiadavky";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "Potvrdenie prijatia";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "Obsahové nápovedy";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "História rozširovania zoznamu emailov";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "Moduly S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "Syntax kryptografickej správy";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "Rozšírené bezpečnostné služby";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "Identifikátor S/MIME objektov";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "S/MIME V3 správa";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "Elektronický podpis ETS 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "Elektronický podpis ETS 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "Pravidlá elektronického podpisu ETS 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "Pravidlá elektronického podpisu ETS 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "Typy S/MIME obsahu";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "Autentifikované atribúty S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "Algoritmy S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "Distribúcia S/MIME certifikátu";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "Distribúcia LDAP certifikátu";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "Kvalifikátor pravidiel S/MIME podpisu";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-notice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "Identifikátor typu S/MIME podpisu";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "Podpis pôvodcu";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "Podpis domény";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "Podpis dodatočných atribútov";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "Prehodnotiť podpis";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "Možnosti S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "Preferovať binárny obsah";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "Priateľský názov (pre PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "ID lokálneho kľúča (pre PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "Typy certifikátov (pre PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "Certifikát X.509 (pre PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "Certifikát SDSI (pre PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "Typy CRL (pre PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "X.509 CRL (pre PKCS-12)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "Syntax výmeny osobných údajov PKCS-12";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "ID šifrovaní založených na hesle PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE s SHA-1 a 128-Bit RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE s SHA-1 a 40-Bit RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PKCS-12 PBE s SHA-1 a 3-kľúčový Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PKCS-12 PBE s SHA-1 a 2-kľúčový Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE s SHA-1 a 128-Bit RC2-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE s SHA-1 a 40-Bit RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "ID PKCS-12 ESPVK";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "Ochrana PKCS-12 PKCS-8 kľúča";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "ID balíkov PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "ID balíka kľúča PKCS-12 ";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "ID certifikátu PKCS-12 a CRL balíka";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "ID tajného balíka PKCS-12 ";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "ID bezpečného PKCS-12 obsahu";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "ID balíka chráneného PKCS-12 PKCS-8 kľúča";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "ID balíka PKCS-12 certifikátu";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "ID certifikátu PKCS-12 X.509 a CRL balíka";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "ID balíka PKCS-12 SDSI certifikátu";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "PKCS-12 OID";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "ID šifrovania založenom na hesle PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PKCS-12 PBE s SHA-1 a 128-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PKCS-12 PBE s SHA-1 a 40-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PKCS-12 PBE s SHA-1 a Triple DES-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PKCS-12 PBE s SHA-1 a 128-Bit RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PKCS-12 PBE s SHA-1 a 40-Bit RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PKCS-12 PBE s SHA-1 a RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PKCS-12 PBE s SHA-1 a RC2-CBC";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "ID šifrovaní PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "PKCS-12 RSA šifrovanie s Triple 128-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "PKCS-12 RSA šifrovanie s Triple 40-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "PKCS-12 RSA šifrovanie s Triple DES";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "ID PKCS-12 podpisu";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "Prehľad PKCS-12 RSA podpisu s SHA-1";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 verzia 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "ID balíkov PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "Balík kľúča PKCS-12 ";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "Balík chráneného PKCS-12 PKCS-8 kľúča";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "Balík PKCS-12 certifikátu";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "Balík CRL PKCS-12 ";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "Tajný balík PKCS-12 ";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "Balík bezpečného PKCS-12 obsahu";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "Moduly PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "Atribúty PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "Typ obsahu PKCS-15";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "PKCS-15 obsah";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "Algoritmus prehľadu RSADSI";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC s SHA-1";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "Šifrovacie algoritmy RSADSI";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 s MAC";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "RC5-CBC Pad";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Neznámy identifikátor pravidiel Identrus";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "MIT užívateľ-užívateľ Kerberos";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Triedy objektov Microsoft Exchange servera";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Adresovanie stránok";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "Schéma triedy";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "Schéma atribútu";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "Mailbox-Agent";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "Emailová schránka";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "Kontajner";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "Príjemca emailu";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "Mechanizmus doručovania";

"06 07 2A 86 48 86 F7 14 04"				= "Formáty Microsoft súborov";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Autentifikačný kód";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "Nepriami kontext dát SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "Informácie agentúry SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "Typ oznámenia SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "Informácie SPC Opus";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "Rozšírenia certifikátov SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "Obrazové dáta SPC PE";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "Odkaz SPC (typ 1)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "Individuálny Code Signing";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "Komerčný Code Signing";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "Odkaz SPC (typ 2)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "Minimálne kritériá SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "Finančné kritériá SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "Odkaz SPC (typ 3)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "Poskytovateľ podpory NTLM bezpečnosti";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "Protipodpis časovej pečiatky";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "Zoznam dôvery certifikátov";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "Roztriedené rozšírenie CTL";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "Umiestnenie ďalšej lokalizácie";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "Rozšírené použitie kľúča";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "Podpisovanie zoznamu dôvery certifikátov";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "Podpísanie časovej pečiatky";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "SGC";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "Serializované šifrovanie";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "Šifrované súborové systémy";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "Obnova šifrovaných súborových systémov";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Kompatibilný s Windows hardwarom";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "Podpisovanie NT5";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Podpisovanie Windows OEM hardwaru";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "Vložené podpisovanie NT";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "Podpisovanie zoznamu dôveryhodných koreňov";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "Kvalifikovaná subordinácia";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "Obnova kľúča";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "Podpisovanie dokumentu";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "Identifikátory atribučného objektu";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "Atribút dôvery Áno/Nie";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Microsoft Music DRM";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Individualizácia Microsoft DRM";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Licencie Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Server Microsoft licencií";

"06 08 2B 06 01 04 01 82 37 0D"				= "Identifikátory Microsoft PKCS-10 objektov";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "Certifikát obnovy";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "Názov registrácie/Hodnota páru";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "Registrácia CSP";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "Verzia OS";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Atribúty Microsoft PKCS-12";
"06 09 2B 06 01 04 01 82 37 11 01"			= "Sada kľúčov lokálneho počítača";

"06 08 2B 06 01 04 01 82 37 14"				= "Infraštruktúra registrácie Microsoft";
"06 09 2B 06 01 04 01 82 37 14 01"			= "Automaticky registrovať použitie CTL";
"06 09 2B 06 01 04 01 82 37 14 02"			= "Typ registrácie certifikátu";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "Registračný agent";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "Smartcard prihlásenie";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "Základné meno NT";

"06 08 2B 06 01 04 01 82 37 15"				= "Infraštruktúra certifikačného servera Microsoft";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Verzia obnovy Microsoft CA";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "Verzia CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 02"			= "Atribút CAPICOM";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "Názov dokumentu";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "Popis dokumentu";
"06 09 2B 06 01 04 01 82 37 58 03"			= "Šifrované dáta";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "Šifrovaný obsah";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "Identifikátor pravidiel UNINETT";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "Identifikátor pravidiel ICE-TEL";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "Identifikátor pravidiel ICE-TEL CA";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CFC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal s SHA-1";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal s RIPEMD-160";
"06 09 2B 06 01 04 01 97 55 03 01"			= "Atribúty cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "Kontrola prítomnosti cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "OCSP odpoveď RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "OCSP odpoveď RTCS rozšírené";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "Rozšírený dôvod CRL";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "Vlastnosti kľúča";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "PKI štart";
"06 09 2B 06 01 04 01 97 55 04 01"			= "cryptlib obsah";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "Konfiguračné dáta cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "Index užívateľa cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "Informácie o užívateľovi cryptlib";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "Identifikátor pravidiel XYZZY";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Timeproof";
"06 08 2B 06 01 04 01 AA 60 01"		= "Systém časovej pečiatky";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "Systém časovej pečiatky 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "Systém časovej pečiatky 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "Systém časovej pečiatky 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "Sekundárny postup";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "Fyzický identifikátor";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos V5";
"06 06 2B 06 01 05 02 03"           = "Kerberos PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "Autentifikačné dáta Kerberos";
"06 07 2B 06 01 05 02 03 02"        = "Dáta Kerberos Diffie-Hellman kľúča";
"06 07 2B 06 01 05 02 03 03"        = "Odpoveď dát Kerberos kľúča";
"06 07 2B 06 01 05 02 03 04"        = "Autentifikácia Kerberos klienta";
"06 07 2B 06 01 05 02 03 05"        = "Distribučné centrum Kerberos kľúča (KDC)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "Mechanizmus jednoduchých verejných kľúčov (SPKM)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "Infraštruktúra verejného kľúča";

"06 07 2B 06 01 05 05 07 01"		= "Rozšírenia privátnych certifikátov PKIX";
"06 08 2B 06 01 05 05 07 01 01"		= "Prístup k informáciám certifikačnej autority";
"06 08 2B 06 01 05 05 07 01 02"		= "Biometrické informácie";
"06 08 2B 06 01 05 05 07 01 03"		= "Oznámenia kvalifikovaných certifikátov";
"06 08 2B 06 01 05 05 07 01 04"		= "Identita auditu atribútového certifikátu";
"06 08 2B 06 01 05 05 07 01 05"		= "Targeting atribútového certifikátu";
"06 08 2B 06 01 05 05 07 01 06"		= "Ovládanie právomoci atribútového certifikátu";
"06 08 2B 06 01 05 05 07 01 07"		= "Blok SBGP IP asdresy";
"06 08 2B 06 01 05 05 07 01 08"		= "Identifikátor autonómneho systému SBGP";
"06 08 2B 06 01 05 05 07 01 09"		= "Identifikátor SBGP routera";
"06 08 2B 06 01 05 05 07 01 0A"		= "Proxying atribútového certifikátu";
"06 08 2B 06 01 05 05 07 01 0B"		= "Prístup k informáciám subjektu";
"06 08 2B 06 01 05 05 07 01 0C"		= "Logotype";

"06 07 2B 06 01 05 05 07 02"		= "Typy kvalifikátorov pravidiel";
"06 08 2B 06 01 05 05 07 02 01"		= "Oznámenie vykonania certifikátu";
"06 08 2B 06 01 05 05 07 02 02"		= "Užívateľská poznámka";
"06 08 2B 06 01 05 05 07 02 03"		= "Textová poznámka";

"06 07 2B 06 01 05 05 07 03"		= "Účel kľúča";
"06 08 2B 06 01 05 05 07 03 01"		= "Autentifikácia servera";
"06 08 2B 06 01 05 05 07 03 02"		= "Autentifikácia klienta";
"06 08 2B 06 01 05 05 07 03 03"		= "Code Signing";
"06 08 2B 06 01 05 05 07 03 04"		= "Ochrana emailov";
"06 08 2B 06 01 05 05 07 03 05"		= "Koncový systém IPSEC";
"06 08 2B 06 01 05 05 07 03 06"		= "IPSEC tunel";
"06 08 2B 06 01 05 05 07 03 07"		= "Užívateľ IPSEC";
"06 08 2B 06 01 05 05 07 03 08"		= "Časová pečiatka";
"06 08 2B 06 01 05 05 07 03 09"		= "Podpisovanie OCSP";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "Autentifikácia SBGP AA servera";

"06 07 2B 06 01 05 05 07 04"		= "Typy CMP informácií";
"06 08 2B 06 01 05 05 07 04 01"		= "Certifikát šifrovania protokolu CA";
"06 08 2B 06 01 05 05 07 04 02"		= "Typy podpisových párových kľúčov";
"06 08 2B 06 01 05 05 07 04 03"		= "Typy šifrovania párového kľúča";
"06 08 2B 06 01 05 05 07 04 04"		= "Preferovaný symetrický algoritmus";
"06 08 2B 06 01 05 05 07 04 05"		= "Informácie o aktualizácii CA kľúča";
"06 08 2B 06 01 05 05 07 04 06"		= "Aktuálne CRL";
"06 08 2B 06 01 05 05 07 04 07"		= "Nepodporované OID";
"06 08 2B 06 01 05 05 07 04 08"		= "Požiadavka odoberania";
"06 08 2B 06 01 05 05 07 04 09"		= "Odpoveď odoberania";
"06 08 2B 06 01 05 05 07 04 0A"		= "Požiadavka parametra párového kľúča";
"06 08 2B 06 01 05 05 07 04 0B"		= "Odpoveď parametra párového kľúča";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "Registrácia CRMF";
"06 08 2B 06 01 05 05 07 05 01"		= "Registračná kontrola";
"06 09 2B 06 01 05 05 07 05 01 01"	= "Registračný Token";
"06 09 2B 06 01 05 05 07 05 01 02"	= "Autentifikátor";
"06 09 2B 06 01 05 05 07 05 01 03"	= "Publikačné informácie PKI";
"06 09 2B 06 01 05 05 07 05 01 04"	= "Možnosti archivácie PKI";
"06 09 2B 06 01 05 05 07 05 01 05"	= "ID starého certifikátu";
"06 09 2B 06 01 05 05 07 05 01 06"	= "Šifrovací kľúč protokolu";
"06 09 2B 06 01 05 05 07 05 01 07"	= "Šablóna alternatívneho certifikátu";
"06 09 2B 06 01 05 05 07 05 01 08"	= "Šablóna WAP WTLS";

"06 08 2B 06 01 05 05 07 05 02"		= "Registračné informácie CRMF";
"06 09 2B 06 01 05 05 07 05 02 01"	= "UTF-8 Páry";
"06 09 2B 06 01 05 05 07 05 02 02"	= "Žiadosť o certifikát ";

"06 07 2B 06 01 05 05 07 06"		= "Algoritmy";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "Žiadny podpis";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "Ovládanie CMC";

"06 07 2B 06 01 05 05 07 08"		= "Iné mená";
"06 08 2B 06 01 05 05 07 08 01"		= "Osobné údaje";
"06 08 2B 06 01 05 05 07 08 02"		= "Skupina užívateľov";

"06 07 2B 06 01 05 05 07 09"		= "Osobné údaje";
"06 08 2B 06 01 05 05 07 09 01"		= "Dátum narodenia";
"06 08 2B 06 01 05 05 07 09 02"		= "Miesto narodenia";
"06 08 2B 06 01 05 05 07 09 03"		= "Pseudonym";
"06 08 2B 06 01 05 05 07 09 04"		= "Pohlavie";
"06 08 2B 06 01 05 05 07 09 05"		= "Občianstvo";
"06 08 2B 06 01 05 05 07 09 06"		= "Krajina pobytu";

"06 07 2B 06 01 05 05 07 0A"		= "Atribútový certifikát";
"06 08 2B 06 01 05 05 07 0A 01"		= "Autentifikačná informácia";
"06 08 2B 06 01 05 05 07 0A 02"		= "Prístupová identita";
"06 08 2B 06 01 05 05 07 0A 03"		= "Platobná identita";
"06 08 2B 06 01 05 05 07 0A 04"		= "Skupina";
"06 08 2B 06 01 05 05 07 0A 05"		= "Role";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "Protokol stavu online certifikátu";
"06 09 2B 06 01 05 05 07 30 01 01"	= "Základná odpoveď OCSP";
"06 09 2B 06 01 05 05 07 30 01 02"	= "Rozšírenie OCSP nonce";
"06 09 2B 06 01 05 05 07 30 01 03"	= "Referencia OCSP CRL";
"06 09 2B 06 01 05 05 07 30 01 04"	= "Odpoveď OCSP";
"06 09 2B 06 01 05 05 07 30 01 05"	= "Kontrola OCSP ne-revokácie";
"06 09 2B 06 01 05 05 07 30 01 06"	= "Prerušenie OCSP archívu";
"06 09 2B 06 01 05 05 07 30 01 07"	= "Lokátor služby OCSP";

"06 08 2B 06 01 05 05 07 30 02"		= "Vydavatelia CA";
"06 08 2B 06 01 05 05 07 30 03"		= "Časová pečiatka";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "IKE prechodný";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "Šifrovací algoritmus DEC";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "Hašovací algoritmus DEC";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "Algoritmus podpisu DEC";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 s RSA";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 s RSA";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 s RSA";
"06 05 2B 0E 03 02 03"				= "MD5 s RSA";
"06 05 2B 0E 03 02 04"				= "MD4 s RSA šifrovaním";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N s RSA";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "RSA podpis";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA s SHA";
"06 05 2B 0E 03 02 0E"				= "MDC2 s RSA podpisom";
"06 05 2B 0E 03 02 0F"				= "SHA s RSA podpisom";
"06 05 2B 0E 03 02 10"				= "Diffie-Hellman s Common Modulus";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "Všeobecný DSA";
"06 05 2B 0E 03 02 15"				= "Všeobecný DSA s SHA";
"06 05 2B 0E 03 02 16"				= "Prenos RSA kľúča";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "MD2 s RSA podpisom";
"06 05 2B 0E 03 02 19"				= "MD5 s RSA podpisom";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "DSA s SHA-1";
"06 05 2B 0E 03 02 1C"				= "DSA s všeobecným SHA-1";
"06 05 2B 0E 03 02 1D"				= "SHA-1 s RSA šifrovaním";
"06 05 2B 0E 03 03 01"				= "Simple-strong-auth-mechanism";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 s RSA";
"06 06 2B 0E 07 02 03 02"			= "MD2 s ElGamal";

/* Teletrust */

"06 03 2B 24 01"					= "Dokument";
"06 04 2B 24 01 01"					= "Konečná verzia";
"06 04 2B 24 01 02"					= "Koncept";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "Algoritmus";
"06 04 2B 24 03 01"					= "Šifrovací algoritmus";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "DES-ECB Pad";
"06 07 2B 24 03 01 01 01 01"		= "DES-ECB ISO Pad";
"06 07 2B 24 03 01 01 02 01"		= "DES-CBC Pad";
"06 08 2B 24 03 01 01 02 01 01"		= "DES-CBC ISO Pad";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "DES3-ECB Pad";
"06 08 2B 24 03 01 03 01 01 01"		= "DES3-ECB ISO Pad";
"06 07 2B 24 03 01 03 02 01"		= "DES3-CBC Pad";
"06 08 2B 24 03 01 03 02 01 01"		= "DES3-CBC ISO Pad";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "IDEA-ECB Pad";
"06 08 2B 24 03 01 02 01 01 01"		= "IDEA-ECB ISO Pad";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "IDEA-CBC Pad";
"06 08 2B 24 03 01 02 02 01 01"		= "IDEA-CBC ISO Pad";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "RSA šifrovanie";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "BSI-1-ECB Pad";
"06 06 2B 24 03 01 05 02"			= "BSI-1-CBC PEM Pad";
"06 07 2B 24 03 01 05 02 01"		= "BSI-1-CBC PEM Pad";

"06 04 2B 24 03 02"					= "Hašovací algoritmus";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "Jednoduchá dĺžka MDC2";
"06 05 2B 24 03 02 05"				= "Dvojitá dĺžka MDC2";
"06 04 2B 24 03 03"					= "Algoritmus podpisu";
"06 05 2B 24 03 03 01"				= "RSA podpis";

"06 06 2B 24 03 03 01 01"			= "RSA podpis s SHA-1";
"06 09 2B 24 03 03 01 01 84 00 02"	= "RSA podpis s SHA-1 512/L2";
"06 09 2B 24 03 03 01 01 85 00 02"	= "RSA podpis s SHA-1 640/L2";
"06 09 2B 24 03 03 01 01 86 00 02"	= "RSA podpis s SHA-1 768/L2";
"06 09 2B 24 03 03 01 01 87 00 02"	= "RSA podpis s SHA-1 896/L2";
"06 09 2B 24 03 03 01 01 88 00 02"	= "RSA podpis s SHA-1 1024/L2";
"06 09 2B 24 03 03 01 01 84 00 03"	= "RSA podpis s SHA-1 512/L3";
"06 09 2B 24 03 03 01 01 85 00 03"	= "RSA podpis s SHA-1 640/L3";
"06 09 2B 24 03 03 01 01 86 00 03"	= "RSA podpis s SHA-1 768/L3";
"06 09 2B 24 03 03 01 01 87 00 03"	= "RSA podpis s SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 03"	= "RSA podpis s SHA-1 1024/L3";
"06 09 2B 24 03 03 01 01 84 00 05"	= "RSA podpis s SHA-1 512/L5";
"06 09 2B 24 03 03 01 01 85 00 05"	= "RSA podpis s SHA-1 640/L5";
"06 09 2B 24 03 03 01 01 86 00 05"	= "RSA podpis s SHA-1 768/L5";
"06 09 2B 24 03 03 01 01 87 00 05"	= "RSA podpis s SHA-1 896/L5";
"06 09 2B 24 03 03 01 01 88 00 05"	= "RSA podpis s SHA-1 1024/L5";
"06 09 2B 24 03 03 01 01 84 00 09"	= "RSA podpis s SHA-1 512/L9";
"06 09 2B 24 03 03 01 01 85 00 09"	= "RSA podpis s SHA-1 640/L9";
"06 09 2B 24 03 03 01 01 86 00 09"	= "RSA podpis s SHA-1 768/L9";
"06 09 2B 24 03 03 01 01 87 00 09"	= "RSA podpis s SHA-1 896/L9";
"06 09 2B 24 03 03 01 01 88 00 09"	= "RSA podpis s SHA-1 1024/L9";
"06 09 2B 24 03 03 01 01 84 00 11"	= "RSA podpis s SHA-1 512/L11";
"06 09 2B 24 03 03 01 01 85 00 11"	= "RSA podpis s SHA-1 640/L11";
"06 09 2B 24 03 03 01 01 86 00 11"	= "RSA podpis s SHA-1 768/L11";
"06 09 2B 24 03 03 01 01 87 00 11"	= "RSA podpis s SHA-1 896/L11";
"06 09 2B 24 03 03 01 01 88 00 11"	= "RSA podpis s SHA-1 1024/L11";

"06 06 2B 24 03 03 01 02"			= "RSA podpis s RIPEMD-160";
"06 09 2B 24 03 03 01 02 84 00 02"	= "RSA podpis s RIPEMD-160 512/L2";
"06 09 2B 24 03 03 01 02 85 00 02"	= "RSA podpis s RIPEMD-160 640/L2";
"06 09 2B 24 03 03 01 02 86 00 02"	= "RSA podpis s RIPEMD-160 768/L2";
"06 09 2B 24 03 03 01 02 87 00 02"	= "RSA podpis s RIPEMD-160 896/L2";
"06 09 2B 24 03 03 01 02 88 00 02"	= "RSA podpis s RIPEMD-160 1024/L2";
"06 09 2B 24 03 03 01 02 84 00 03"	= "RSA podpis s RIPEMD-160 512/L3";
"06 09 2B 24 03 03 01 02 85 00 03"	= "RSA podpis s RIPEMD-160 640/L3";
"06 09 2B 24 03 03 01 02 86 00 03"	= "RSA podpis s RIPEMD-160 768/L3";
"06 09 2B 24 03 03 01 02 87 00 03"	= "RSA podpis s RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 03"	= "RSA podpis s RIPEMD-160 1024/L3";
"06 09 2B 24 03 03 01 02 84 00 05"	= "RSA podpis s RIPEMD-160 512/L5";
"06 09 2B 24 03 03 01 02 85 00 05"	= "RSA podpis s RIPEMD-160 640/L5";
"06 09 2B 24 03 03 01 02 86 00 05"	= "RSA podpis s RIPEMD-160 768/L5";
"06 09 2B 24 03 03 01 02 87 00 05"	= "RSA podpis s RIPEMD-160 896/L5";
"06 09 2B 24 03 03 01 02 88 00 05"	= "RSA podpis s RIPEMD-160 1024/L5";
"06 09 2B 24 03 03 01 02 84 00 09"	= "RSA podpis s RIPEMD-160 512/L9";
"06 09 2B 24 03 03 01 02 85 00 09"	= "RSA podpis s RIPEMD-160 640/L9";
"06 09 2B 24 03 03 01 02 86 00 09"	= "RSA podpis s RIPEMD-160 768/L9";
"06 09 2B 24 03 03 01 02 87 00 09"	= "RSA podpis s RIPEMD-160 896/L9";
"06 09 2B 24 03 03 01 02 88 00 09"	= "RSA podpis s RIPEMD-160 1024/L9";
"06 09 2B 24 03 03 01 02 84 00 11"	= "RSA podpis s RIPEMD-160 512/L11";
"06 09 2B 24 03 03 01 02 85 00 11"	= "RSA podpis s RIPEMD-160 640/L11";
"06 09 2B 24 03 03 01 02 86 00 11"	= "RSA podpis s RIPEMD-160 768/L11";
"06 09 2B 24 03 03 01 02 87 00 11"	= "RSA podpis s RIPEMD-160 896/L11";
"06 09 2B 24 03 03 01 02 88 00 11"	= "RSA podpis s RIPEMD-160 1024/L11";

"06 06 2B 24 03 03 01 03"			= "RSA podpis s RIPEMD-128";
"06 06 2B 24 03 03 01 04"			= "RSA podpis s RIPEMD-256";

"06 05 2B 24 03 03 02"				= "ECSIE podpis";
"06 06 2B 24 03 03 02 01"			= "ECSIE podpis s SHA-1";
"06 06 2B 24 03 03 02 02"			= "ECSIE podpis s RIPEMD-160";
"06 06 2B 24 03 03 02 03"			= "ECSIE podpis s MD2";
"06 06 2B 24 03 03 02 04"			= "ECSIE podpis s MD5";

"06 04 2B 24 03 04"					= "Osnova podpisu";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 s RED";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 s RSA";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 s RND";

"06 03 2B 24 04"					= "Atribút";
"06 03 2B 24 05"					= "Pravidlá";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "API špecifické pre výrobcu";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "API špecifické pre funkciu";
"06 03 2B 24 07"					= "Správa kľúča";
"06 04 2B 24 07 01"					= "Dohoda kľúčov";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "Prenos kľúča";
"06 05 2B 24 07 02 01"				= "ISO9796-2 s RSA šifrovaním";

"06 05 2B 24 08 01 01"				= "Identifikátor pravidiel Teletrust SigiSigConform";
"06 05 2B 24 08 02 01"				= "Adresárová služba";

"06 05 2B 24 08 03 01"				= "Dátum vytvorenia certifikátu";
"06 05 2B 24 08 03 02"				= "Plná moc";
"06 05 2B 24 08 03 03"				= "Prístup";
"06 05 2B 24 08 03 04"				= "Finančný limit";
"06 05 2B 24 08 03 05"				= "Deklarácia väčšiny";
"06 05 2B 24 08 03 06"				= "Sériové číslo integrovaného obvodu karty";
"06 05 2B 24 08 03 07"				= "Referencia verejného kľúča";
"06 05 2B 24 08 03 08"				= "Obmedzenie";
"06 05 2B 24 08 03 09"				= "Obnoviť, ak je to povolené";
"06 05 2B 24 08 03 0A"				= "Požadovaný certifikát";
"06 05 2B 24 08 03 0B"				= "Menovacia autorita";
"06 05 2B 24 08 03 0C"				= "Certifikát je v adresári od";
"06 05 2B 24 08 03 0D"				= "Hašovanie certifikátu";

"06 05 2B 24 08 04 01"				= "Osobné údaje";
"06 05 2B 24 08 04 08"				= "Obmedzenie";
"06 07 2B 24 08 05 01 01 01"		= "RSA Indicate SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA Indicate RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "RSA s SHA-1";
"06 07 2B 24 08 05 01 01 04"		= "RSA s RIPEMD-160";
"06 07 2B 24 08 05 01 02 01"		= "Rozšírený DSA";
"06 07 2B 24 08 05 01 02 02"		= "DSA s RIPEMD-160";

"06 05 2B 24 08 06 01"				= "Certifikát";
"06 05 2B 24 08 06 02"				= "Referencia certifikátu";
"06 05 2B 24 08 06 03"				= "Atribútový certifikát";
"06 05 2B 24 08 06 04"				= "Referencia atribútu";
"06 05 2B 24 08 06 05"				= "Názov súboru";
"06 05 2B 24 08 06 06"				= "Čas uloženia";
"06 05 2B 24 08 06 07"				= "Veľkosť súboru";
"06 05 2B 24 08 06 08"				= "Umiestnenie";
"06 05 2B 24 08 06 09"				= "Číslo podpisu";
"06 05 2B 24 08 06 0A"				= "Automaticky generovaný";

"06 05 2B 24 08 07 01"				= "Typy prezentácie Teletrust";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "Binárny";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Draw";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "Postscript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "Text";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Rozšírenia certifikátov Thawte";
"06 05 2B 65 01 04 01"				= "Silný Extranet";

/* X.520 */

"06 02 55 04"		= "Typy atribútov X.520";
"06 03 55 04 00"	= "Trieda objektu";
"06 03 55 04 01"	= "Aliasovaný názov záznamu";
"06 03 55 04 02"	= "Informácie o vedomostiach";
"06 03 55 04 03"	= "Bežné meno";
"06 03 55 04 04"	= "Priezvisko";
"06 03 55 04 05"	= "Sériové číslo";
"06 03 55 04 06"	= "Názov krajiny";
"06 03 55 04 07"	= "Názov lokality";
"06 04 55 04 07 01"	= "Kolektívny názov lokality";
"06 03 55 04 08"	= "Názov štátu alebo provincie";
"06 04 55 04 08 01"	= "Kolektívny názov štátu alebo provincie";
"06 03 55 04 09"	= "Adresa ulice";
"06 04 55 04 09 01"	= "Kolektívna adresa ulice";
"06 03 55 04 0A"	= "Názov organizácie";
"06 04 55 04 0A 01"	= "Kolektívny názov organizácie";
"06 03 55 04 0B"	= "Názov organizačnej jednotky";
"06 04 55 04 0B 01"	= "Kolektívny názov organizačnej jednotky";
"06 03 55 04 0C"	= "Názov";
"06 03 55 04 0D"	= "Popis";
"06 03 55 04 0E"	= "Sprievodca vyhľadávaním";
"06 03 55 04 0F"	= "Kategória podnikania";
"06 03 55 04 10"	= "Korešpondenčná adresa";
"06 04 55 04 10 01"	= "Kolektívna korešpondenčná adresa";
"06 03 55 04 11"	= "PSČ";
"06 04 55 04 11 01"	= "Kolektívne PSČ";
"06 03 55 04 12"	= "P.O.Box";
"06 04 55 04 12 01"	= "Kolektívny P.O.Box";
"06 03 55 04 13"	= "Názov kancelárie pre doručenie";
"06 04 55 04 13 01"	= "Kolektívny názov kancelárie pre doručenie";
"06 03 55 04 14"	= "Telefónne číslo";
"06 04 55 04 14 01"	= "Kolektívne telefónne číslo";
"06 03 55 04 15"	= "Telex číslo";
"06 04 55 04 15 01"	= "Kolektívne Telex číslo";
"06 03 55 04 16"	= "Identifikátor Teletex Terminalu";
"06 04 55 04 16 01"	= "Kolektívny identifikátor Teletex Terminalu";
"06 03 55 04 17"	= "Faksimilné telefónne číslo";
"06 04 55 04 17 01"	= "Kolektívne faksimilné telefónne číslo";
"06 03 55 04 18"	= "Adresa X.121";
"06 03 55 04 19"	= "Medzinárodné ISDN číslo";
"06 04 55 04 19 01"	= "Kolektívne medzinárodné ISDN číslo";
"06 03 55 04 1A"	= "Registrovaná adresa";
"06 03 55 04 1B"	= "Indikátor destinácie";
"06 03 55 04 1C"	= "Preferovaný spôsob doručenia";
"06 03 55 04 1D"	= "Doručovacia adresa";
"06 03 55 04 1E"	= "Kontext podporovaných aplikácií";
"06 03 55 04 1F"	= "Člen";
"06 03 55 04 20"	= "Vlastník";
"06 03 55 04 21"	= "Role Occupant";
"06 03 55 04 22"	= "Pozrite tiež";
"06 03 55 04 23"	= "Užívateľské heslo";
"06 03 55 04 24"	= "Certifikát užívateľa";
"06 03 55 04 25"	= "Certifikát CA";
"06 03 55 04 26"	= "Zoznam revokovaných autorít";
"06 03 55 04 27"	= "Zoznam revokovaných certifikátov";
"06 03 55 04 28"	= "Dvojica skrížených certifikátov";
"06 03 55 04 29"	= "Meno";
"06 03 55 04 2A"	= "Stanovený názov";
"06 03 55 04 2B"	= "Iniciály";
"06 03 55 04 2C"	= "Generačný kvalifikátor";
"06 03 55 04 2D"	= "Jedinečný identifikátor";
"06 03 55 04 2E"	= "Kvalifikátor DN";
"06 03 55 04 2F"	= "Sprievodca rozšíreným vyhľadávaním";
"06 03 55 04 30"	= "Informácie o protokole";
"06 03 55 04 31"	= "Významné meno";
"06 03 55 04 32"	= "Jedinečný člen";
"06 03 55 04 33"	= "Identifikátor domu";
"06 03 55 04 34"	= "Podporované algoritmy";
"06 03 55 04 35"	= "Zoznam Delta revokácií";
"06 03 55 04 36"	= "Preverenie";
"06 03 55 04 3A"	= "Dvojica skrížených certifikátov";

/* X.500 object classes */

"06 02 55 06"		= "Trieda objektu X.520";
"06 03 55 06 00"	= "Top";
"06 03 55 06 01"	= "Alias";
"06 03 55 06 02"	= "Krajina";
"06 03 55 06 03"	= "Lokalita";
"06 03 55 06 04"	= "Organizácia";
"06 03 55 06 05"	= "Organizačná jednotka";
"06 03 55 06 06"	= "Osoba";
"06 03 55 06 07"	= "Organizačná osoba";
"06 03 55 06 08"	= "Organizačná úloha";
"06 03 55 06 09"	= "Skupina mien";
"06 03 55 06 0A"	= "Residential Person";
"06 03 55 06 0B"	= "Proces aplikácie";
"06 03 55 06 0C"	= "Entita aplikácie";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "Zariadenie";
"06 03 55 06 0F"	= "Užívateľ so silnou autentifikáciou";
"06 03 55 06 10"	= "Certifikačná autorita";
"06 03 55 06 11"	= "Skupina jedinečných mien";
"06 03 55 06 15"	= "PKI užívateľ";
"06 03 55 06 16"	= "PKI CA";

/* X.500 algorithms */

"06 02 55 08"		= "Algoritmy X.500";
"06 03 55 08 01"	= "Šifrovacie algoritmy X.500";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "Rozšírenia certifikátov X.509";
"06 03 55 1D 01"	= "Identifikátor kľúča autority (starý)";
"06 03 55 1D 02"	= "Atribúty primárneho kľúča (staré)";
"06 03 55 1D 03"	= "Pravidlá certifikátu (staré)";
"06 03 55 1D 04"	= "Obmedzenie použitia kľúča (staré)";
"06 03 55 1D 05"	= "Mapovania pravidiel (staré)";
"06 03 55 1D 06"	= "Obmedzenie podstromov";
"06 03 55 1D 07"	= "Alternatívne meno subjektu (staré)";
"06 03 55 1D 08"	= "Alternatívne meno vydavateľa (staré)";
"06 03 55 1D 09"	= "Atribúty adresára subjektu";
"06 03 55 1D 0A"	= "Základné obmedzenia (staré 2.5.29.10)";
"06 03 55 1D 0B"	= "Obmedzenia názvu (staré)";
"06 03 55 1D 0C"	= "Obmedzenia pravidiel (staré)";
"06 03 55 1D 0D"	= "Základné obmedzenia (staré 2.5.29.13)";
"06 03 55 1D 0E"	= "Identifikátor kľúča subjektu";
"06 03 55 1D 0F"	= "Použitie kľúča";
"06 03 55 1D 10"	= "Doba používania privátneho kľúča";
"06 03 55 1D 11"	= "Alternatívne meno subjektu";
"06 03 55 1D 12"	= "Alternatívne meno vydavateľa";
"06 03 55 1D 13"	= "Základné obmedzenia";
"06 03 55 1D 14"	= "Číslo v zozname revokovaných certifikátov";
"06 03 55 1D 15"	= "Kód dôvodu CRL";
"06 03 55 1D 16"	= "Dátum vypršania platnosti (starý)";
"06 03 55 1D 17"	= "Inštrukcia udržovania-Kód";
"06 03 55 1D 18"	= "Dátum neplatnosti";
"06 03 55 1D 19"	= "Distribučné body CRL (staré)";
"06 03 55 1D 1A"	= "Distribučný bod vydávania (starý)";
"06 03 55 1D 1B"	= "Indikátor Delta CRL";
"06 03 55 1D 1C"	= "Distribučný bod vydávania";
"06 03 55 1D 1D"	= "Vydavateľ certifikátu";
"06 03 55 1D 1E"	= "Obmedzenia názvu";
"06 03 55 1D 1F"	= "Distribučné body CRL";
"06 03 55 1D 20"	= "Pravidlá certifikátu";
"06 04 55 1D 20 00"	= "Identifikátor akýchkoľvek pravidiel";
"06 03 55 1D 21"	= "Mapovania pravidiel";
"06 03 55 1D 22"	= "Obmedzenia pravidiel";
"06 03 55 1D 23"	= "Identifikátor kľúča autority";
"06 03 55 1D 24"	= "Obmedzenia pravidiel";
"06 03 55 1D 25"	= "Rozšírené použitie kľúča";
"06 04 55 1D 25 00"	= "Akékoľvek rozšírené použitie kľúča";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "Algoritmus SDNS podpisu";
"06 09 60 86 48 01 65 02 01 01 02"	= "Algoritmus podpisu Fortezza";
"06 09 60 86 48 01 65 02 01 01 03"	= "Algoritmus utajenia SDNS";
"06 09 60 86 48 01 65 02 01 01 04"	= "Algoritmus utajenia Fortezza";
"06 09 60 86 48 01 65 02 01 01 05"	= "Algoritmus integrity SDNS";
"06 09 60 86 48 01 65 02 01 01 06"	= "Algoritmus integrity Fortezza";
"06 09 60 86 48 01 65 02 01 01 07"	= "Algoritmus ochrany tokenu SDNS";
"06 09 60 86 48 01 65 02 01 01 08"	= "Algoritmus ochrany tokenu Fortezza";
"06 09 60 86 48 01 65 02 01 01 09"	= "Algoritmus správy kľúčov SDNS";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Algoritmus správy kľúčov Fortezza";
"06 09 60 86 48 01 65 02 01 01 0B"	= "Algoritmus správy kľúčov a podpisu SDNS";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Algoritmus správy kľúčov a podpisu Fortezza";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Algoritmus Suite A podpisu";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Algoritmus utajenia Suite A";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Algoritmus integrity Suite A";
"06 09 60 86 48 01 65 02 01 01 10"	= "Algoritmus ochrany tokenu Suite A";
"06 09 60 86 48 01 65 02 01 01 11"	= "Algoritmus správy kľúčov Suite A";
"06 09 60 86 48 01 65 02 01 01 12"	= "Algoritmus správy kľúčov a podpisu Suite A";
"06 09 60 86 48 01 65 02 01 01 13"	= "Aktualizovaný algoritmus podpisu Fortezza";
"06 09 60 86 48 01 65 02 01 01 14"	= "Algoritmy správy kľúčov a aktualizovaného podpisu Fortezza";
"06 09 60 86 48 01 65 02 01 01 15"	= "Aktualizovaný algoritmus integrity Fortezza";
"06 09 60 86 48 01 65 02 01 01 16"	= "Algoritmus výmeny kľúča";
"06 09 60 86 48 01 65 02 01 01 17"	= "Algoritmus Fortezza Wrap80";
"06 09 60 86 48 01 65 02 01 01 18"	= "Algoritmus šifrovania kľúča (KEA)";

"06 09 60 86 48 01 65 02 01 02 01"	= "Formát správy RFC 822";
"06 09 60 86 48 01 65 02 01 02 02"	= "Vyprázdniť obsah";
"06 09 60 86 48 01 65 02 01 02 03"	= "Typ CSP obsahu";
"06 09 60 86 48 01 65 02 01 02 2A"	= "Typ MSP Rev 3 obsahu";
"06 09 60 86 48 01 65 02 01 02 30"	= "Typ MSP obsahu";
"06 09 60 86 48 01 65 02 01 02 31"	= "Protokol MSP Rekey agenta";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "Typ MSP Rev 3.1 obsahu";
"06 09 60 86 48 01 65 02 01 02 48"	= "Časť tela preposlanej MSP správy";
"06 09 60 86 48 01 65 02 01 02 49"	= "Parametre preposlanej MSP správy";
"06 09 60 86 48 01 65 02 01 02 50"	= "Časť tela preposlanej CSP správy";
"06 09 60 86 48 01 65 02 01 02 51"	= "Parametre preposlanej CSP správy";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "Pravidlá bezpečnosti SDNS";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mozaikový PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "Pravidlá bezpečnosti";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "Všeobecný";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "Predvolené pravidlá bezpečnosti";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "Certifikát správy kľúčov SDNS";
"06 09 60 86 48 01 65 02 01 05 02"	= "Certifikát podpisu užívateľa SDNS";
"06 09 60 86 48 01 65 02 01 05 03"	= "Certifikát správy kľúčov a podpisu SDNS";
"06 09 60 86 48 01 65 02 01 05 04"	= "Certifikát správy kľúčov Fortezza";
"06 09 60 86 48 01 65 02 01 05 05"	= "Certifikát správy kľúčov a podpisu Fortezza";
"06 09 60 86 48 01 65 02 01 05 06"	= "Certifikát podpisu užívateľa Fortezza";
"06 09 60 86 48 01 65 02 01 05 07"	= "Certifikát podpisu CA Fortezza";
"06 09 60 86 48 01 65 02 01 05 08"	= "Certifikát podpisu SDNS CA";
"06 09 60 86 48 01 65 02 01 05 0A"	= "Pomocný vektor";
"06 09 60 86 48 01 65 02 01 05 0B"	= "Pravidlá potvrdzovania prijatia";
"06 09 60 86 48 01 65 02 01 05 0C"	= "Členstvo";
"06 09 60 86 48 01 65 02 01 05 0D"	= "Správcovia";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "Meta SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "CKL podpisu Meta SDNS";
"06 09 60 86 48 01 65 02 01 05 2B"	= "CKL podpisu SDNS";
"06 09 60 86 48 01 65 02 01 05 2C"	= "Zoznam revokovaných SDNS certifikátov";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Zoznam revokovaných Fortezza certifikátov";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "Procesor vyňatej adresy";
"06 09 60 86 48 01 65 02 01 05 30"	= "Strážca";
"06 09 60 86 48 01 65 02 01 05 31"	= "Podporované algoritmy";
"06 09 60 86 48 01 65 02 01 05 32"	= "Certifikát správy kľúčov Suite A";
"06 09 60 86 48 01 65 02 01 05 33"	= "Certifikát správy kľúčov a podpisu Suite A";
"06 09 60 86 48 01 65 02 01 05 34"	= "Certifikát podpisu užívateľa Suite A";
"06 09 60 86 48 01 65 02 01 05 35"	= "PRBAC informácie";
"06 09 60 86 48 01 65 02 01 05 36"	= "Obmedzenia PRBAC CA";
"06 09 60 86 48 01 65 02 01 05 37"	= "Práva správy podpisu alebo kľúča";
"06 09 60 86 48 01 65 02 01 05 38"	= "Práva Comm";
"06 09 60 86 48 01 65 02 01 05 39"	= "Atribút so známkou";
"06 09 60 86 48 01 65 02 01 05 3A"	= "Informačný súbor pravidiel";
"06 09 60 86 48 01 65 02 01 05 3B"	= "Informačný súbor bezpečnostného postupu";
"06 09 60 86 48 01 65 02 01 05 3C"	= "Obmedzenia preverenia CA";

"06 09 60 86 48 01 65 02 01 07 01"		= "Rozšírenia CPS";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "Bezpečnostné kategórie ISSI";
"06 09 60 86 48 01 65 02 01 08 02"		= "Štandardné práva bezpečnostnej známky";

"06 09 60 86 48 01 65 02 01 0A 01"			= "Práva podpisu";
"06 09 60 86 48 01 65 02 01 0A 02"			= "Práva správy kľúča";
"06 09 60 86 48 01 65 02 01 0A 03"			= "Práva pomenovaného tagu";
"06 09 60 86 48 01 65 02 01 0B 01"			= "UK Demo";
"06 09 60 86 48 01 65 02 01 0B 02"			= "US Department of Defense Trieda 2";
"06 09 60 86 48 01 65 02 01 0B 03"			= "US Medium Pilot";
"06 09 60 86 48 01 65 02 01 0B 04"			= "US Department of Defense Trieda 4";
"06 09 60 86 48 01 65 02 01 0B 05"			= "US Department of Defense Trieda 3";
"06 09 60 86 48 01 65 02 01 0B 06"			= "US Department of Defense Trieda 5";
"06 09 60 86 48 01 65 02 01 0B 09"			= "US Department of Defense PKI Trieda 3";

"06 09 60 86 48 01 65 02 01 0C 00"			= "Test pravidiel bezpečnosti";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1 SecurityCategories";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "TSP1 Tag nastavil nulu";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "TSP1 Tag nastavil jedna";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "TSP1 Tag nastavil dva";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "Bezpečnostné kategórie TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "TSP2 Tag nastavil nulu";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "TSP2 Tag nastavil jedna";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "TSP2 Tag nastavil dva";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Bezpečnostné kategórie Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Kafka Tag Set názov 1";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Kafka Tag Set názov 2";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Kafka Tag Set názov 3";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "Test záznamu CRL";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "Známka";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "Identifikátor pravidiel GAK";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "Identifikátor neúplných pravidiel FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "Identifikátor základných pravidiel FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "Identifikátor stredných pravidiel FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "Identifikátor vysokých pravidiel FBCA";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "KRA kľúč";
"06 08 60 86 48 01 65 03 02 03"			= "Rozšírenia";
"06 09 60 86 48 01 65 03 02 03 01"		= "Technika obnovy kľúča";
"06 09 60 86 48 01 65 03 02 03 02"		= "Schopnosť obnovy kľúča";
"06 09 60 86 48 01 65 03 02 03 03"		= "Obnova kľúča";
"06 08 60 86 48 01 65 03 02 04"			= "Osnovy obnovy kľúčov";
"06 08 60 86 48 01 65 03 02 05"			= "Rozšírenie CSOR GAK";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "Algoritmus NIST";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Algoritmus Novell";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "DES-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "DES-EDE2-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "DES-EDE3-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "RC5-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "MD2 s RSA šifrovaním BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "MD5 s RSA šifrovaním BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "SHA-1 s RSA šifrovaním BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "Prehľad LM";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC s SHA1-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC s MD5-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "RC2-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "Balík MD4";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "RSA šifrovanie BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "Heslo NW";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "Typy atribútov PKI";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "Atribúty bezpečnosti";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "Hranice dôvery";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Identifikátor Netscape objektu";
"06 08 60 86 48 01 86 F8 42 01"		= "Rozšírenie certifikátu Netscape";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Typ Netscape certifikátu";
"06 09 60 86 48 01 86 F8 42 01 02"	= "Základné URL Netscape";
"06 09 60 86 48 01 86 F8 42 01 03"	= "URL revokácie Netscape";
"06 09 60 86 48 01 86 F8 42 01 04"	= "URL revokácie Netscape CA";
"06 09 60 86 48 01 86 F8 42 01 05"	= "URL sťahovania Netscape CRL";
"06 09 60 86 48 01 86 F8 42 01 06"	= "URL stiahnutia Netscape CA certifikátu";
"06 09 60 86 48 01 86 F8 42 01 07"	= "URL obnovy Netscape certifikátu";
"06 09 60 86 48 01 86 F8 42 01 08"	= "URL pravidiel Netscape CA";
"06 09 60 86 48 01 86 F8 42 01 09"	= "URL domovskej stránky Netscape certifikátu";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Logo entity Netscape certifikátu";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Obrázok užívateľa Netscape certifikátu";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Názov Netscape SSL servera";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Komentár Netscape certifikátu";

"06 08 60 86 48 01 86 F8 42 02"		= "Typ Netscape dát";
"06 09 60 86 48 01 86 F8 42 02 01"	= "obrázok/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "obrázok/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "text/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Sekvencia Netscape certifikátu";
"06 09 60 86 48 01 86 F8 42 02 06"	= "URL Netscape certifikátu";

"06 08 60 86 48 01 86 F8 42 03"			= "Identifikátor adresára Netscape objektu";
"06 09 60 86 48 01 86 F8 42 03 01"		= "Definície LDAP";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "Licencia pre auto";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "Číslo oddelenia";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "Číslo zamestnanca";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "Typ zamestnanca";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "Organizačná osoba intranetu";

"06 09 60 86 48 01 86 F8 42 04 01"		= "SGC";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Verisign InBox";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "Neznáme rozšírenie Verisign VPN";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "Neznáme rozšírenie Verisign VPN";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Identifikátor pravidiel Verisign";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Verisign CPS v1 Oznam";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "Verisign SGC CA";

/* SET */

"06 03 67 2A 00"	= "Typ obsahu";
"06 04 67 2A 00 00"	= "PAN dáta";
"06 04 67 2A 00 01"	= "PAN Token";
"06 04 67 2A 00 02"	= "Len PAN";

"06 03 67 2A 01"	= "Rozšírenie správy";
"06 03 67 2A 02"	= "Pole";
"06 04 67 2A 02 00"	= "Celé meno";
"06 04 67 2A 02 01"	= "Stanovený názov";
"06 04 67 2A 02 02"	= "Priezvisko";
"06 04 67 2A 02 03"	= "Rodné priezvisko";
"06 04 67 2A 02 04"	= "Názov miesta";
"06 04 67 2A 02 05"	= "Identifikačné číslo";
"06 04 67 2A 02 06"	= "Mesiac";
"06 04 67 2A 02 07"	= "Dátum";
"06 04 67 2A 02 08"	= "Adresa";
"06 04 67 2A 02 09"	= "Telefón";
"06 04 67 2A 02 0A"	= "Množstvo";
"06 04 67 2A 02 0B"	= "Číslo účtu";
"06 04 67 2A 02 0C"	= "Passphrase";

"06 03 67 2A 03"		= "Atribút";
"06 04 67 2A 03 00"		= "Certifikát";
"06 05 67 2A 03 00 00"	= "Thumbprint koreňového kľúča";
"06 05 67 2A 03 00 01"	= "Dodatočné pravidlo";

"06 03 67 2A 04"	= "Algoritmus";
"06 03 67 2A 05"	= "Pravidlá";
"06 04 67 2A 05 00"	= "Koreň";
"06 03 67 2A 06"	= "Modul";
"06 03 67 2A 07"	= "Rozšírenie certifikátu";
"06 04 67 2A 07 00"	= "Hašovaný koreňový kľúč ";
"06 04 67 2A 07 01"	= "Typ certifikátu";
"06 04 67 2A 07 02"	= "Obchodné údaje";
"06 04 67 2A 07 03"	= "Vyžaduje sa Card certifikát";
"06 04 67 2A 07 04"	= "Tuneling";
"06 04 67 2A 07 05"	= "Rozšírenia SET";
"06 04 67 2A 07 06"	= "SET kvalifikátor";

"06 03 67 2A 08"	= "Značka";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "Dodávateľ";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Entrust";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Oprávnenie";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "Národný";
"06 05 67 2A 0A E2 00"	= "Japonsko";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "Hašovaný koreňový kľúč ";
"06 04 86 8D 6F 03"	= "Typ certifikátu";
"06 04 86 8D 6F 04"	= "Obchodné údaje";
"06 04 86 8D 6F 05"	= "Vyžaduje sa Card certifikát";
"06 04 86 8D 6F 06"	= "Tuneling";
"06 04 86 8D 6F 07"	= "SET kvalifikátor";
"06 04 86 8D 6F 63"	= "SET dáta";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Bezpečnosť Apple dát";

"06 08 2A 86 48 86 F7 63 64 01" = "Identifikátor pravidiel Apple Trust";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Pravidlá Apple iSign";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Základné pravidlá Apple X.509";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Pravidlá Apple SSL";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Pravidlá vytvárania Apple Local certifikátu";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Pravidlá vytvárania Apple Local CSR";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Pravidlá revokácie Apple CRL";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Pravidlá revokácie Apple OCSP";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Pravidlá Apple S/MIME";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Pravidlá predĺžiteľnej Apple autentifikácie";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Pravidlá podpisovania Apple Software Update";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Pravidlá Apple IPsec";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Pravidlá Apple iChat";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Pravidlá podpisovania Apple Resource";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Pravidlá Apple Kerberos klienta";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Pravidlá Apple Kerberos servera";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Pravidlá Apple Code Signing";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Pravidlá podpisovania Apple Package";

"06 08 2A 86 48 86 F7 63 64 02" = "Identifikátor algoritmu Apple bezpečnosti";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "Rýchle elipsové šifrovanie (FEE)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "Zabezpečená kompresia Apple (ASC)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "FEE s MD5 podpisom";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "FEE s SHA-1 podpisom";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Šifrovanie Apple FEED";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple FEED (experimentálny)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "FEE s ECDSA podpisom";

"06 08 2A 86 48 86 F7 63 64 03" = "Identifikátor certifikátu Apple .Mac";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Žiadosť o Apple .Mac certifikát";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Žiadosť o certifikát Apple .Mac identity";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Žiadosť o certifikát podpisovania Apple .Mac emailov";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Žiadosť o certifikát šifrovania Apple .Mac emailov";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Žiadosť o zoznam Apple .Mac archívu";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Žiadosť o uloženie Apple .Mac archívu";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Žiadosť o načítanie Apple .Mac archívu";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Žiadosť o odstránenie Apple .Mac archívu";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Rozšírenie certifikátu Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Apple .Mac identita";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Podpisovanie Apple .Mac emailov";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Šifrovanie Apple .Mac emailov";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Hodnota žiadosti o Apple .Mac certifikát";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "Meno";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "Heslo";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "Host";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "Obnoviť značku";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "Asynchrónna značka";

"06 08 2A 86 48 86 F7 63 64 04" = "Rozšírené použitie Apple kľúča";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Apple Code Signing";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Apple Code Signing (vývoj)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Podpisovanie Apple Software Update";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Apple Code Signing (rezervované)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Apple Resource Signing";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Podpisovanie Apple iChat";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Šifrovanie Apple iChat";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Identita Apple Systému";

"06 08 2A 86 48 86 F7 63 64 05" = "Pravidlo Apple certifikátov";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Pravidlá Apple certifikátov";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Pravidlá Apple .Mac certifikátov";

/* Extended key usage */

"06 04 55 1D 25 03"					= "Code Signing";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Bezpečnosť Intel CDSA";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Bezpečnostné formáty Intel CDSA";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "Rozšírenia certifikátov X.509v3";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "Rozšírenia privátnych certifikátov X.509v3";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "Bitmapa podpisu subjektu";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "Obrázok subjektu";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "Emailová adresa subjektu";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "Použiť výnimky";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Bezpečnostné algoritmy Intel CDSA";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 s ECDSA";

/* end */
